// ---------------------------------------------------Задачки, які треба періодично вирішувати для повторення----------------------------------------------------------
/*
Використовуючи ф-ю if...else, напишіть код, який запитуватиме: "Яка офіційна назва JavaScript?"
Якщо користувач вводить "ECMAScript", то показити через alert: "Вірно!".
Інакше відобразити: "Не знаєте? ECMAScript!"

Алгоритм:
1. Створити функцію
2. Написати умову
3. Викликати функцію вказавши як параметр prompt() - запит, який з'явиться на сайті. Відповідь, яку ти напишеш і буде змінною answer.

*/

/* якщо на prompt() натиснем cancel(відміна), то у answer запишеться null і тоді буде помилка, бо null.toLowerCase... не зможе виконатись.
Тому треба виключити такий випадок і просто вийти з функції якщо користувач натисне cancel:
  if (answer === null) {
  return; }
або додати додаткову умову перевірки (answer !== null).
toLowerCase() і trim() використовуємо щоб нормалізувати відповідь користувача - привести до одного реєстру та обрізати пробіли по боках. */

// function checkAnswer(answer) {
//   if (answer !== null && answer.toLowerCase().trim() === 'ecmascript') {
//     alert('Вірно!');
//   } else {
//     alert('Не знаєте? ECMAScript!');
//   }
// }

// checkAnswer(prompt('Яка офіційна назва JavaScript?'));

// --------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/* Напиши функцію, яка буде отримувати номер користувача (10 цифр) і повертатиме закодовані перші 6 цифр.
Н-д, якщо номер 0976590822, то ф-я має повертати ******0822.
Алгоритм:
1. Створення функції
2. Ф-я буде приймати як параметр те, що користувач напише в prompt().
3. Вихід з функції, якщо користувач натисне cancel.
4. Обробка відповіді користувача
5. Використання методу slice();
6. Використання методу padStart();
*/

// function markNumber(number) {
//   // console.log(typeof number); // string

//   if (number === null) {
//     return;
//   } else if (number.trim().length < 10 || number.trim().length > 10) {
//     alert('Number length should consist of 10 numbers');
//   } else {
//     const trimNumber = number.slice(-4); // якщо вказуємо від'ємне число, то рахуємо з кінця починаючи з -1 і обрізаємо спереді (див приклад нижче)
//     const markedNumber = trimNumber.padStart(number.length, '*');
//     return markedNumber;
//   }
// }

// console.log(markNumber(prompt('Please, enter your number here')));

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------
// const cardNumber = '12345678910';
// const trimCardNumber = cardNumber.slice(-1);
// const trimCardNumberNew = cardNumber.slice(-5);
// console.log(trimCardNumber); // 0
// console.log(trimCardNumberNew); // 78910
//-------------------------------------------------------------------------------------------------------------------------------------------------------

/**
Напишіть програму, яка отримає від користувача число (кількість хвилин)та виведе в консоль рядок в форматі годин та хвилин.

 */

// function greeting(text) {
//   return text;
// }

// console.log(greeting('hello'));
