// -------------------------------------------------ОБ'ЄКТИ------------------------------------------------------------------------------------
/*
Об'єкти дозволяють описати та згрупувати характеристики об'єктів реального світу, наприклад, користувач, книга, продукт магазину — чого завгодно.
Об'єкти ще називають словниками, тобто вони містять терміни (властивості) та їх визначення (значення).

const apartment = {
  descr: 'Spacious apartment in the city center',
  rate: 8,
  price: 2345,
  tags: ['top', 'promo', 'extraLarge', 'center'],
};

Вкладені властивості
Значенням властивості може бути інший об'єкт. Це використовується для зберігання вкладених і згрупованих даних.

const user = {
  name: 'Olga',
  location: {
    country: 'Ukraine',
    city: 'Kyiv',
  },
  stats: {
    likes: 1230,
    followers: 345,
  },
};

Доступ до властивостей через крапку
Перший спосіб отримати доступ до властивості об'єкта — це синтаксис objectName.key.
- На місце звернення буде повернуте значення властивості з таким ключем.
- Якщо в об'єкті відсутня властивість з таким ключем, на місце звернення повернеться undefined.

Здебільшого синтаксис «через крапку» використовується тоді, коли ми заздалегідь знаємо ім'я (ключ) властивості, до якої хочемо отримати доступ.

const book = {
  name: 'Hercule Poirot',
  author: 'Agatha Cristie',
  genres: ['novels', 'detectives'],
  rate: 8.1,
};

const bookName = book.name;
console.log(bookName); // 'Hercule Poirot'


*/
